/***************************************************************** 
 *
 * 行列の固有値計算関係
 *
 *
 *                           Created  by Mamoru Ota (2018/03/09)
 * 
 *****************************************************************/

#include"MATRIX.h"

// *******************************************************************
// 実対称3重対角行列
//
//            | t0[0]  t1[0]     0      0  ...         0          0  |
//            | t1[0]  t0[1]  t1[1]     0  ...         .          .  |
//            |    0   t1[1]  t0[2]  t1[2] ...         .          .  |
// T        = |    0      0   t1[2]  t0[3] ...         .          .  |
//            |    .      .      .      .              0          0  |
//            |    0      0      0      0  ...  t1[n - 3]         0  | 
//            |    0      0      0      0  ...  t0[n - 2]  t1[n - 2] | 
//            |    0      0      0      0  ...  t1[n - 2]  t0[n - 1] |
//
// のQR分解(T = QR)を行う. 上三角行列Rは, 
//
//            | r0[0]  r1[0]  r2[0]     0  ...         0          0  |
//            |    0   r0[1]  r1[1]  r2[1] ...         .          .  |
//            |    0      0   r0[2]  r1[2] ...         .          .  |
// R        = |    0      0      0   r0[3] ...         .          .  |
//            |    .      .      .      .       r2[n - 4]         0  |
//            |    0      0      0      0  ...  r1[n - 3]  r2[n - 3] | 
//            |    0      0      0      0  ...  r0[n - 2]  r1[n - 2] | 
//            |    0      0      0      0  ...         0   r0[n - 1] |
//  
// となっており, 直交行列Qは,
//
// Q        = P[0]^{T}P[1]^{T}P[2]^{T}...P[n - 2]^{T}
//
// で与えられる. 
// ここで, 
//
//            |  c[0]   s[0]     0      0  ...         0          0  |
//            | -s[0]   c[0]     0      0  ...         .          .  |
//            |    0      0      1      0  ...         .          .  |
// P[0]     = |    0      0      0      1  ...         .          .  |
//            |    .      .      .      .              0          0  |
//            |    0      0      0      0  ...         0          0  | 
//            |    0      0      0      0  ...         1          0  | 
//            |    0      0      0      0  ...         0          1  |
//
//            |    1      0      0      0  ...         0          0  |
//            |         c[1]   s[1]     0  ...         .          .  |
//            |    0   -s[1]   c[1]     0  ...         .          .  |
// P[1]     = |    0      0      0      1  ...         .          .  |
//            |    .      .      .      .              0          0  |
//            |    0      0      0      0  ...         0          0  | 
//            |    0      0      0      0  ...         1          0  | 
//            |    0      0      0      0  ...         0          1  |
// ...
//
//            |    1      0      0      0  ...         0          0  |
//            |           1      0      0  ...         .          .  |
//            |    0      0      1      0  ...         .          .  |
// P[n - 2] = |    0      0      0      1  ...         .          .  |
//            |    .      .      .      .              0          0  |
//            |    0      0      0      0  ...         0          0  | 
//            |    0      0      0      0  ...   c[n - 2]   s[n - 2] | 
//            |    0      0      0      0  ...  -s[n - 2]   c[n - 2] |
//
// である. 
// 
// *******************************************************************
void REAL__MATRIX_QR_TRI(REAL c [],//(out)[n - 1] : 直交行列の情報を表すパラメータ
                         REAL s [],//(out)[n - 1] : 直交行列の情報を表すパラメータ
                         REAL r0[],//(out)[n]     : 上三角行列の対角成分
                         REAL r1[],//(out)[n - 1] : 上三角行列の非対角成分1
                         REAL r2[],//(out)[n - 2] : 上三角行列の非対角成分2 (r2の計算が不要な場合はNULLを入れる)
                         REAL t0[],//(in) [n]     : 3重対角行列の対角成分
                         REAL t1[],//(in) [n - 1] : 3重対角行列の非対角成分
                         INT  n){  //(in)         : 3重対角行列の次元数
  REAL L;
  INT  i;
  
  for(i = 0;i < n    ;i++){
    r0[i] = t0[i];
  }
  for(i = 0;i < n - 1;i++){
    r1[i] = t1[i];
  }

  for(i = 0;i < n - 2;i++){
    L         = REAL__SQRT(REAL__ADD(REAL__MUL(r0[i],r0[i]),REAL__MUL(t1[i],t1[i])));
    if(REAL__EQ(L,REAL__ZERO())){
      c[i   ] = REAL__ONE ();
      s[i   ] = REAL__ZERO();
    }else{
      c[i   ] = REAL__DIV(r0[i],L);
      s[i   ] = REAL__DIV(t1[i],L);
    }
    r0[i    ] = L;
    r0[i + 1] = REAL__ADD(REAL__MUL(REAL__NEGATIVE(s[i]),r1[i]),REAL__MUL(c[i],t0[i + 1]));
    r1[i    ] = REAL__ADD(REAL__MUL(               c[i] ,r1[i]),REAL__MUL(s[i],t0[i + 1]));
    r1[i + 1] = REAL__MUL(c[i],t1[i + 1]);
  }
    L         = REAL__SQRT(REAL__ADD(REAL__MUL(r0[i],r0[i]),REAL__MUL(t1[i],t1[i])));
    if(REAL__EQ(L,REAL__ZERO())){
      c[i   ] = REAL__ONE ();
      s[i   ] = REAL__ZERO();
    }else{
      c[i   ] = REAL__DIV(r0[i],L);
      s[i   ] = REAL__DIV(t1[i],L);
    }
    r0[i    ] = L;
    r0[i + 1] = REAL__ADD(REAL__MUL(REAL__NEGATIVE(s[i]),r1[i]),REAL__MUL(c[i],t0[i + 1]));
    r1[i    ] = REAL__ADD(REAL__MUL(               c[i] ,r1[i]),REAL__MUL(s[i],t0[i + 1]));  

  if(r2 != NULL){
    for(i = 0;i < n - 2;i++){
      r2[i] = REAL__MUL(s[i],t1[i + 1]);
    }
  }
}
