/***************************************************************** 
 *
 * 行列の固有値計算関係
 *
 *
 *                           Created  by Mamoru Ota (2018/03/09)
 * 
 *****************************************************************/

#include"MATRIX.h"

// *******************************************************************
// 実対称3重対角行列
//
//            | t0[0]  t1[0]     0      0  ...         0          0  |
//            | t1[0]  t0[1]  t1[1]     0  ...         .          .  |
//            |    0   t1[1]  t0[2]  t1[2] ...         .          .  |
// T        = |    0      0   t1[2]  t0[3] ...         .          .  |
//            |    .      .      .      .              0          0  |
//            |    0      0      0      0  ...  t1[n - 3]         0  | 
//            |    0      0      0      0  ...  t0[n - 2]  t1[n - 2] | 
//            |    0      0      0      0  ...  t1[n - 2]  t0[n - 1] |
//
// のQR分解(T = QR)により得られるRとQ(REAL__MATRIX_QR_TRIにより計算可能)からRQを計算する. 
// すなわち
//            | u0[0]  u1[0]     0      0  ...         0          0  |
//            | u1[0]  u0[1]  u1[1]     0  ...         .          .  |
//            |    0   u1[1]  u0[2]  u1[2] ...         .          .  |
// RQ       = |    0      0   u1[2]  u0[3] ...         .          .  |
//            |    .      .      .      .              0          0  |
//            |    0      0      0      0  ...  u1[n - 3]         0  | 
//            |    0      0      0      0  ...  u0[n - 2]  u1[n - 2] | 
//            |    0      0      0      0  ...  u1[n - 2]  u0[n - 1] |
// を返す. 
// *******************************************************************
void REAL__MATRIX_RQ_TRI(REAL u0[],//(out)[n]     : 3重対角行列RQの対角成分
                         REAL u1[],//(out)[n - 1] : 3重対角行列RQの非対角成分
                         REAL c [],//(in) [n - 1] : QR分解の直交行列Qの情報を表すパラメータ
                         REAL s [],//(in) [n - 1] : QR分解の直交行列Qの情報を表すパラメータ
                         REAL r0[],//(in) [n]     : QR分解の上三角行列Rの対角成分
                         REAL r1[],//(in) [n - 1] : QR分解の上三角行列Rの非対角成分1
                         INT  n){  //(in)         : 行列の次元数
  INT i;
  
    u0[0    ] = c[0]            * r0[0    ] + s[0] * r1[0];
  for(i = 1;i < n - 1;i++){
    u0[i    ] = c[i] * c[i - 1] * r0[i    ] + s[i] * r1[i];
  }
    u0[n - 1] =        c[n - 2] * r0[n - 1];
  
  for(i = 0;i < n - 1;i++){
    u1[i] = s[i] * r0[i + 1];
  }
}
