/***************************************************************** 
 *
 * 行列の固有値計算関係
 *
 *
 *                           Created  by Mamoru Ota (2018/03/09)
 * 
 *****************************************************************/

#include"MATRIX.h"

// *******************************************************************
// 実対称3重対角行列
//
//            | T0[0]  T1[0]     0      0  ...         0          0  |
//            | T1[0]  T0[1]  T1[1]     0  ...         .          .  |
//            |    0   T1[1]  T0[2]  T1[2] ...         .          .  |
// T        = |    0      0   T1[2]  T0[3] ...         .          .  |
//            |    .      .      .      .              0          0  |
//            |    0      0      0      0  ...  T1[n - 3]         0  | 
//            |    0      0      0      0  ...  T0[n - 2]  T1[n - 2] | 
//            |    0      0      0      0  ...  T1[n - 2]  T0[n - 1] |
//
// のQR分解(T = QR)により得られるRとQ(REAL__MATRIX_QR_TRIにより計算可能)からRQを計算する. 
// すなわち
//            | U0[0]  U1[0]     0      0  ...         0          0  |
//            | U1[0]  U0[1]  U1[1]     0  ...         .          .  |
//            |    0   U1[1]  U0[2]  U1[2] ...         .          .  |
// RQ       = |    0      0   U1[2]  U0[3] ...         .          .  |
//            |    .      .      .      .              0          0  |
//            |    0      0      0      0  ...  U1[n - 3]         0  | 
//            |    0      0      0      0  ...  U0[n - 2]  U1[n - 2] | 
//            |    0      0      0      0  ...  U1[n - 2]  U0[n - 1] |
// を返す. 
// *******************************************************************
void REAL__MATRIX_RQ_TRI(REAL U0[],//(out)[n]     : 3重対角行列RQの対角成分
                         REAL U1[],//(out)[n - 1] : 3重対角行列RQの非対角成分
                         REAL C [],//(in) [n - 1] : QR分解の直交行列Qの情報を表すパラメータ
                         REAL S [],//(in) [n - 1] : QR分解の直交行列Qの情報を表すパラメータ
                         REAL R0[],//(in) [n]     : QR分解の上三角行列Rの対角成分
                         REAL R1[],//(in) [n - 1] : QR分解の上三角行列Rの非対角成分1
                         INT  n){  //(in)         : 行列の次元数
  INT i;
  
    U0[0    ] = C[0]            * R0[0    ] + S[0] * R1[0];
  for(i = 1;i < n - 1;i++){
    U0[i    ] = C[i] * C[i - 1] * R0[i    ] + S[i] * R1[i];
  }
    U0[n - 1] =        C[n - 2] * R0[n - 1];
  
  for(i = 0;i < n - 1;i++){
    U1[i] = S[i] * R0[i + 1];
  }
}
